//
// Created by lipnegju on 2019-06-26.
//

#include <printf.h>

/**
 * ----------------------------------------------------------------------------------------------
 * |         类型              |             作用域                |          生命周期            |
 * ----------------------------------------------------------------------------------------------
 * |1.  局部变量 int a =10      |        从变量定义到函数结束          |     局部变量创建到函数结束   |
 * -----------------------------------------------------------------------------------------------
 * |2.  全局变量 int a=10       |        整个项目文件                 |     整个运行期                |
 * -----------------------------------------------------------------------------------------------
 * |3.  static 局部变量         |        一对{}内                   |     运行期                    |
 * -----------------------------------------------------------------------------------------------
 * |4.  static 全局变量         |        当前文件                    |    运行期                    |
 * -----------------------------------------------------------------------------------------------
 * |5.  static void test()     |        当前文件                    |    运行期                    |
 * -----------------------------------------------------------------------------------------------
 * |6.  void test()            |        整个项目文件中               |    运行期                    |
 * -----------------------------------------------------------------------------------------------
 * |7.  auto 变量               |       一对{}内                    |    当前函数                   |
 * -----------------------------------------------------------------------------------------------
 * |8.  extern 变量             |       整个程序                     |    运行期                    |
 * -----------------------------------------------------------------------------------------------
 * |9.  extrn 函数              |       整个项目                     |    运行期                    |
 * -----------------------------------------------------------------------------------------------
 * |10. static 函数             |       当前文件                     |    运行期                    |
 * -----------------------------------------------------------------------------------------------
 * |11. register 变量           |       一对{}内                     |    当前函数                  |
 * -----------------------------------------------------------------------------------------------
 *
 */

/**
 * 声明的作用，可以使用这个变量,声明变量不会分配内存空间，定义时会分配内存空间
 */
extern int z;


/**
 * 1.全局变量作用整个项目中，使用的前提是需要在使用的文件中声明
 * 2.如果在函数内部是局部变量，在函数外部是全局变量
 * 3.如果在同一文件就不用声明了，只定义就可以
 */
//int z =100;

/**
 * 1.静态全局变量的作用范围是整个文件内
 * 2.
 */
static int zz =100;
int xx =200;

void fun(int a, int b, int c){

    //a = b;
    b=c;
    c=a+b;
    printf("%d\n",c);
    static int d =40;
//    printf("%d\n",x);
//    printf("%d\n",y);
    z=900;
    zz=40;
    zz=50;
    xx=2000;
    printf("%d\n",z);
    printf("%d\n",zz);

    //int x =10;
    auto signed int x =10;
}

void staticVar(){
    /**
     * 静态局部变量
     * 1.只初始化一次，可以多次赋值
     */
    static int a =10; // 11,12,13,14....
//    int a =10; // 10,10,10,10,10 ...
    printf("%d\n",a++);
}

void testStatic1(){
    for (int i = 0; i <10 ; i++) {
        staticVar();
    }
}

/**
 * 静态函数，作用范围是当前文件
 */
static void testStaticFun(){

}
/**
 * 如果函数定义在调用函数下方，需要声明，函数声明尽量写在.h文件中  所有的函数都是全局函数
 */
extern void testFun();

void scope(){
  int a=10;
  fun(a,a,a);
  //autoTest();
//  testStatic();
   testFun();
}

extern int bb;
signed int bb =10;

/**
 * auto 可以区分重名的全局变量与局部变量
 */
void testFun(){
//   int bb=10;
   auto signed int bb =10;
}


#if 0
int main(){

}
#endif

